src/test-scripts/example_upload.yaml
config:
  target: "https://run.mocky.io/v3" # base url
  plugins:
    ensure: {}
  ensure: 
    thresholds:
        # p99 of response time must be <250:
        - "http.response_time.p99": 250
        # p95 of response time must be <200:
        - "http.response_time.p95": 200
    conditions:
          - expression: "http.codes.200 > 0 and vusers.failed == 0"
            strict: true
  phases:
    - duration: 15 # duration of phase in seconds
      arrivalRate: 5 # number of simultaneous users
      name: WARM UP # description of phase
  processor: "../processors/index.cjs" # path to all before request functions. look at the file for implementation

scenarios:
  - name: "UPLOAD BLOCK"
    flow:
      - post:
          beforeRequest:
            - "set_example_upload_form_body"
          url: "/e30bc5f3-7456-4f78-9de6-acb478bd7949"
          headers: 
            Content-Type: "multipart/form-data"